<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>PayloadContent</key>
	<array>
		<dict>
			<key>PayloadDescription</key>
			<string>Configures XCreds configuration preferences</string>
			<key>PayloadDisplayName</key>
			<string>XCreds</string>
			<key>PayloadIdentifier</key>
			<string>com.github.erikberglund.ProfileCreator.47F59CD0-E476-4016-A8C6-82837B61C7CE.so.trio.xcreds.F5B79C66-146F-4F8A-9237-CAF10606615C.11BE4B70-7A81-4351-A799-6B6BCBCF0900</string>
			<key>PayloadOrganization</key>
			<string></string>
			<key>PayloadType</key>
			<string>so.trio.xcreds</string>
			<key>PayloadUUID</key>
			<string>11BE4B70-7A81-4351-A799-6B6BCBCF0900</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>clientID</key>
			<string>5487c4cd-949a-402d-9eee-ae8fb696b415</string>
			<key>discoveryURL</key>
			<string>https://login.microsoftonline.com/common/.well-known/openid-configuration</string>
			<key>redirectURI</key>
			<string>https://127.0.0.1/xcreds</string>
			<key>scopes</key>
			<string>profile openid email offline_access</string>
			<key>shouldShowQuitMenu</key>
			<false/>
            <key>loadPageTitle</key>
            <string>This is a custom title!</string>
            <key>loadPageInfo</key>
            <string>please make sure add in some interest interesting information and let the user to click Refresh.\n\nHi Mom!
            </string>
			<key>map_firstname</key>
			<string>given_name</string>
			<key>map_fullname</key>
			<string>name</string>
			<key>map_lastname</key>
			<string>family_name</string>
			<key>map_username</key>
			<string>name</string>
			<key>cloudLoginText</key>
			<string>Back to XCreds</string>
			<key>loginWindowBackgroundImageURL</key>
			<string>file:///System/Library/Desktop Pictures/Monterey Graphic.heic</string>
			<key>loginWindowHeight</key>
			<integer>500</integer>
			<key>loginWindowWidth</key>
			<integer>500</integer>
			<key>shouldShowConfigureWifiButton</key>
			<true/>
			<key>shouldShowMacLoginButton</key>
			<true/>
			<key>shouldShowSupportStatus</key>
			<true/>
			<key>shouldShowVersionInfo</key>
			<true/>
		</dict>
	</array>
	<key>PayloadDescription</key>
	<string>azure xcreds</string>
	<key>PayloadDisplayName</key>
	<string>azure xcreds</string>
	<key>PayloadIdentifier</key>
	<string>com.github.erikberglund.ProfileCreatorAF7B74FE-BF9D-4789-9E78-519C49324120</string>
	<key>PayloadOrganization</key>
	<string>triosoftinc</string>
	<key>PayloadScope</key>
	<string>System</string>
	<key>PayloadType</key>
	<string>Configuration</string>
	<key>PayloadUUID</key>
	<string>7620DBF9-295B-4DFF-B0AE-0629207ECF5A</string>
	<key>PayloadVersion</key>
	<integer>1</integer>
</dict>
</plist>
